	::метка_начала::

класс77777.функ( "cnh",77 ,	"", фн(7), ф())
x= 5*9+7-1/2^3
функция ф0(целое х, пост строка* с) возврат х, с конец
функция ф1(х)
	если ф(х) 
		х=0
	иесли х
		х=70		
	иначе
		х=(фн(666))
		если х<=0 
			х=666
			print(-7^-2^(-1*2)*-2+-(2+2/3),4444)
			пока  x>0 и z~=0 или у~=0
						х = (х)-(1 )
			конец
			w = не true или false и true
		конец
	конец
конец
локал пер1
локал пер2 = 2/х
целое х
целое у = ф1(4)
пост целое хп
пост целое уп = ф1(4)
пост целое* хп
пост целое** уп = ф1(4)
пост = ф1(4)

яя22 5554"класс" ... --
@macro1( 5, 8, "ккк", макро0(7, "стр"),666))@macro0 ()