
функция разбор_строки()

конец





 -- ос.выход()




печать('os.устлокаль()', ос.устлокаль())
ос.устлокаль('ru', 'all')
печать('os.устлокаль()', ос.устлокаль())
ос.выполнить'chcp'

ос.выполнить'@chcp 1251'
ллл=9

кон={}
кон.печать=печать
кон.печать'ллл='
печать(ллл)
печать(_ОКР, _ВЕРСИЯ)
печать(_ОКР==_G, _ВЕРСИЯ==_VERSION)
печать(тип(_ВЕРСИЯ), #_ОКР)
если _ВЕРСИЯ!="Луа 5.3" тогда
	печать"Версия - Ок"
иначе
	печать"Версия - сбой"
конец

локал фмт = "%-20с: %с %4б"
для к,з из пары(_ОКР) начало
	печать(фмт:формат((к),встроку(з), (";"):байт()))
конец
